Abdussalammahmood/esp32-wifi-hw-test/firmware/iperf-esp32s3/managed_components/esp-qa__wifi-cmd/src/sta_cmd.c
/*
 * SPDX-FileCopyrightText: 2024-2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <string.h>
#include "esp_wifi.h"
#include "esp_log.h"
#include "esp_console.h"
#include "argtable3/argtable3.h"
#include "wifi_cmd.h"
#include "esp_private/wifi.h"

#ifndef APP_TAG
#define APP_TAG "WIFI"
#endif

#define MACSTR "%02x:%02x:%02x:%02x:%02x:%02x"
#define MAC2STR(a) (a)[0], (a)[1], (a)[2], (a)[3], (a)[4], (a)[5]
typedef struct {
    struct arg_str *ssid;
    struct arg_str *password;
    struct arg_str *bssid;
    struct arg_int *channel;
    struct arg_lit *no_disconnect;
    struct arg_lit *no_reconnect;
    struct arg_lit *full_scan;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 1) /* IDF commit: 52b24918f01a2e90f395f4056050511516aa0d6e */
    struct arg_int *failure_retry;
#endif
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0) && !CONFIG_WIFI_CMD_BASIC_ONLY
    struct arg_int *rssi_5g_offset;
#endif
#if WIFI_CMD_STA_ROAM_SUPPORTED
    /* roaming related options */
    struct arg_lit *rm_enabled;
    struct arg_lit *btm_enabled;
    struct arg_lit *mbo_enabled;
    struct arg_lit *ft_enabled;
    struct arg_lit *roam_enabled; /* enable all raming related options: rm,btm,mbo,ft */
#endif /* WIFI_CMD_STA_ROAM_SUPPORTED */
#if WIFI_CMD_STA_OWE_SUPPORTED
    struct arg_lit *owe_enabled;
#endif
    struct arg_lit *transition_disable;
    struct arg_int *sae_pwe;
    struct arg_lit *disable_pmf_capable;
    struct arg_lit *pmf_required;
    struct arg_str *threshold_auth;
    struct arg_int *threshold_rssi;
    struct arg_int *sort_method;
    struct arg_int *listen_interval;
#if WIFI_CMD_STA_SAE_PK_SUPPORTED
    struct arg_int *sae_pk_mode;
#endif
#if WIFI_CMD_STA_SAE_PASSWORD_SUPPORTED
    struct arg_str *sae_h2e_identifire;
#endif
#if WIFI_CMD_HE_SUPPORTED
    struct arg_lit *he_mcs9;
    struct arg_lit *he_dcm_set;
    struct arg_int *he_dcm_max_constellation_tx;
    struct arg_int *he_dcm_max_constellation_rx;
    struct arg_lit *he_su_beamformee_disabled;
    struct arg_lit *he_trig_su_bmforming_feedback_disabled;
    struct arg_lit *he_trig_mu_bmforming_partial_feedback_disabled;
    struct arg_lit *he_trig_cqi_feedback_disabled;
#endif
#if WIFI_CMD_5G_SUPPORTED
    struct arg_lit *vht_mcs8;
    struct arg_lit *vht_su_beamformee_disabled;
    struct arg_lit *vht_mu_beamformee_disabled;
#endif
    struct arg_lit *no_reconfig;
#if WIFI_CMD_WPA3_COMPATIBLE_SUPPORTED
    struct arg_lit *disable_wpa3_compatible;
#endif
    struct arg_end *end;
} sta_connect_args_t;
static sta_connect_args_t sta_connect_args;

typedef struct {
    struct arg_str *ssid;
    struct arg_str *bssid;
    struct arg_int *channel;
    struct arg_lit *show_hidden;
    struct arg_lit *null;
    /* active scan */
    struct arg_int *max;
    struct arg_int *min;
    /* passive scan */
    struct arg_lit *passive;
    struct arg_int *passive_time;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
    struct arg_int *home_chan_dwell_time;
    /* scan bitmap */
    struct arg_int *bitmap_2g;
    struct arg_int *bitmap_5g;
#endif
    /* do not show scan details */
    struct arg_lit *count_only;
    struct arg_lit *ax_info;
    struct arg_lit *verbose;
    struct arg_lit *block;
    struct arg_end *end;
} sta_scan_args_t;
static sta_scan_args_t scan_args;

esp_err_t wifi_cmd_sta_connect(wifi_config_t* cfg, bool reconnect)
{
    /* clear auto-reconnect retry count */
    g_wifi_connect_retry_cnt = 0;
    g_wifi_cmd_config.reconnect = reconnect;
    esp_err_t err;

    err = esp_wifi_set_config(WIFI_IF_STA, cfg);
    if (err != ESP_OK) {
        return err;
    }
    err = esp_wifi_connect();
    return err;
}

static esp_err_t wifi_cmd_sta_connect_with_pmf_disable(wifi_config_t* cfg, bool reconnect)
{
    /* clear auto-reconnect retry count */
    g_wifi_connect_retry_cnt = 0;
    g_wifi_cmd_config.reconnect = reconnect;

    esp_err_t err;

    err = esp_wifi_set_config(WIFI_IF_STA, cfg);
    if (err != ESP_OK) {
        return err;
    }
    if (esp_wifi_disable_pmf_config(WIFI_IF_STA) != ESP_OK) {
        ESP_LOGE(APP_TAG, "Failed to disable PMF config");
        return ESP_FAIL;
    }
    err = esp_wifi_connect();
    return err;
}
esp_err_t wifi_cmd_sta_disconnect()
{
    g_wifi_cmd_config.reconnect = false;
    esp_err_t err = esp_wifi_disconnect();
    return err;

}

static int cmd_do_sta_connect(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &sta_connect_args);

    if (nerrors != 0) {
        arg_print_errors(stderr, sta_connect_args.end, argv[0]);
        return 1;
    }

    esp_err_t err = ESP_FAIL;

    wifi_config_t wifi_config = {
        .sta = {
            .scan_method = sta_connect_args.full_scan->count > 0 ? WIFI_ALL_CHANNEL_SCAN : WIFI_FAST_SCAN,
            .sort_method = WIFI_CONNECT_AP_BY_SIGNAL,
        },
    };

    /* use nvs config to connect, ignore all other parameters */
    if (sta_connect_args.no_reconfig->count > 0) {
        g_wifi_connect_retry_cnt = 0;
        g_wifi_cmd_config.reconnect = true;
        err = esp_wifi_connect();
        LOG_WIFI_CMD_DONE(err, "WIFI_CONNECT_START");
        return 0;
    }

    /* ssid must be set */
    if (sta_connect_args.ssid->count == 0) {
        ESP_LOGE(APP_TAG, "ssid must be set");
        return 1;
    }
    const char *ssid = sta_connect_args.ssid->sval[0];
    memcpy((char *) wifi_config.sta.ssid, ssid, sizeof(wifi_config.sta.ssid));
    const char *pass = sta_connect_args.password->sval[0];
    if (sta_connect_args.password->count > 0) {
        memcpy((char *) wifi_config.sta.password, pass, sizeof(wifi_config.sta.password));
        wifi_config.sta.threshold.authmode = WIFI_AUTH_WEP;
    }
    if (sta_connect_args.channel->count > 0) {
        wifi_config.sta.channel = (uint8_t)(sta_connect_args.channel->ival[0]);
    }
    if (sta_connect_args.bssid->count > 0) {
        if (wifi_cmd_str2mac(sta_connect_args.bssid->sval[0], wifi_config.sta.bssid) != ESP_OK) {
            ESP_LOGE(APP_TAG, "Can not parse bssid: %s", sta_connect_args.bssid->sval[0]);
            return 1;
        }
        wifi_config.sta.bssid_set = 1;
    }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0) && !CONFIG_WIFI_CMD_BASIC_ONLY
    if (sta_connect_args.rssi_5g_offset->count > 0) {
        wifi_config.sta.threshold.rssi_5g_adjustment = (uint8_t)(sta_connect_args.rssi_5g_offset->ival[0]);
    } else {
        wifi_config.sta.threshold.rssi_5g_adjustment = DEF_5G_CONN_RSSI_OFFSET;
    }
#endif
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 1) /* IDF commit: 52b24918f01a2e90f395f4056050511516aa0d6e */
    if (sta_connect_args.failure_retry->count > 0) {
        wifi_config.sta.failure_retry_cnt = sta_connect_args.failure_retry->ival[0];
    }
#endif

#if WIFI_CMD_STA_ROAM_SUPPORTED
    if (sta_connect_args.rm_enabled->count > 0) {
        wifi_config.sta.rm_enabled = 1;
    }
    if (sta_connect_args.btm_enabled->count > 0) {
        wifi_config.sta.btm_enabled = 1;
    }
    if (sta_connect_args.mbo_enabled->count > 0) {
        wifi_config.sta.mbo_enabled = 1;
    }
    if (sta_connect_args.ft_enabled->count > 0) {
        wifi_config.sta.ft_enabled = 1;
    }
    if (sta_connect_args.roam_enabled->count > 0) {
        wifi_config.sta.rm_enabled = 1;
        wifi_config.sta.btm_enabled = 1;
        wifi_config.sta.mbo_enabled = 1;
        wifi_config.sta.ft_enabled = 1;
    }
#endif /* WIFI_CMD_STA_ROAM_SUPPORTED */
#if WIFI_CMD_STA_OWE_SUPPORTED
    if (sta_connect_args.owe_enabled->count > 0) {
        wifi_config.sta.owe_enabled = 1;
    }
#endif

