Abdussalammahmood/esp32-wifi-hw-test/firmware/iperf-esp32s3/managed_components/esp-qa__wifi-cmd/src/sta_cmd.c
    /* Try to disconnect from the previous AP before connect. */
    if (sta_connect_args.no_disconnect->count == 0) {
        esp_wifi_disconnect();
    }
    bool reconnect = true;
    if (sta_connect_args.no_reconnect->count > 0) {
        reconnect = false;
    }

    if (sta_connect_args.transition_disable->count > 0) {
        wifi_config.sta.transition_disable = 1;
    }

    if (sta_connect_args.sae_pwe->count > 0) {
        wifi_config.sta.sae_pwe_h2e = sta_connect_args.sae_pwe->ival[0];
    }

    if (sta_connect_args.disable_pmf_capable->count > 0) {
        wifi_config.sta.pmf_cfg.capable = false;
    } else {
        wifi_config.sta.pmf_cfg.capable = true;
    }

    if (sta_connect_args.pmf_required->count > 0) {
        wifi_config.sta.pmf_cfg.required = true;
    } else {
        wifi_config.sta.pmf_cfg.required = false;
    }

    if (sta_connect_args.listen_interval->count > 0) {
        wifi_config.sta.listen_interval = sta_connect_args.listen_interval->ival[0];
    }

    if (sta_connect_args.sort_method->count > 0) {
        wifi_config.sta.sort_method = sta_connect_args.sort_method->ival[0];
    }

#if WIFI_CMD_HE_SUPPORTED
    if (sta_connect_args.he_mcs9->count > 0) {
        wifi_config.sta.he_mcs9_enabled = 1;
    }
    if (sta_connect_args.he_dcm_set->count > 0) {
        wifi_config.sta.he_dcm_set = 1;
    }
    if (sta_connect_args.he_dcm_max_constellation_tx->count > 0) {
        wifi_config.sta.he_dcm_max_constellation_tx = sta_connect_args.he_dcm_max_constellation_tx->ival[0];
    }
    if (sta_connect_args.he_dcm_max_constellation_rx->count > 0) {
        wifi_config.sta.he_dcm_max_constellation_rx = sta_connect_args.he_dcm_max_constellation_rx->ival[0];
    }
    if (sta_connect_args.he_su_beamformee_disabled->count > 0) {
        wifi_config.sta.he_su_beamformee_disabled = 1;
    }
    if (sta_connect_args.he_trig_su_bmforming_feedback_disabled->count > 0) {
        wifi_config.sta.he_trig_su_bmforming_feedback_disabled = 1;
    }
    if (sta_connect_args.he_trig_mu_bmforming_partial_feedback_disabled->count > 0) {
        wifi_config.sta.he_trig_mu_bmforming_partial_feedback_disabled = 1;
    }
    if (sta_connect_args.he_trig_cqi_feedback_disabled->count > 0) {
        wifi_config.sta.he_trig_cqi_feedback_disabled = 1;
    }
#endif
#if WIFI_CMD_5G_SUPPORTED
    if (sta_connect_args.vht_mcs8->count > 0) {
        wifi_config.sta.vht_mcs8_enabled = 1;
    }
    if (sta_connect_args.vht_su_beamformee_disabled->count > 0) {
        wifi_config.sta.vht_su_beamformee_disabled = 1;
    }
    if (sta_connect_args.vht_mu_beamformee_disabled->count > 0) {
        wifi_config.sta.vht_mu_beamformee_disabled = 1;
    }
#endif

#if WIFI_CMD_STA_SAE_PK_SUPPORTED
    if (sta_connect_args.sae_pk_mode->count > 0) {
        wifi_config.sta.sae_pk_mode = sta_connect_args.sae_pk_mode->ival[0];
    }
#endif
#if WIFI_CMD_STA_SAE_PASSWORD_SUPPORTED
    const char *identifier = sta_connect_args.sae_h2e_identifire->sval[0];
    if (sta_connect_args.sae_h2e_identifire->count > 0) {
        memcpy((char *) wifi_config.sta.sae_h2e_identifier, identifier, sizeof(wifi_config.sta.sae_h2e_identifier));
    }
#endif
    const char *threshold_auth = sta_connect_args.threshold_auth->sval[0];
    if (sta_connect_args.threshold_auth->count > 0) {
        wifi_config.sta.threshold.authmode = wifi_cmd_auth_mode_str2num(threshold_auth);
    }
    if (sta_connect_args.threshold_rssi->count > 0) {
        wifi_config.sta.threshold.rssi = sta_connect_args.threshold_rssi->ival[0];
    }
#if WIFI_CMD_WPA3_COMPATIBLE_SUPPORTED
    if (sta_connect_args.disable_wpa3_compatible->count > 0) {
        wifi_config.sta.disable_wpa3_compatible_mode = 1;
        ESP_LOGI(APP_TAG, "disable wpa3 compatible mode");
    }
#endif
    ESP_LOGI(APP_TAG, "Connecting to %s...", ssid);
    if (!wifi_config.sta.pmf_cfg.capable) {
        err = wifi_cmd_sta_connect_with_pmf_disable(&wifi_config, reconnect);
        LOG_WIFI_CMD_DONE(err, "WIFI_CONNECT_START");
        return 0;
    }
    err = wifi_cmd_sta_connect(&wifi_config, reconnect);
    LOG_WIFI_CMD_DONE(err, "WIFI_CONNECT_START");
    return 0;
}

static int cmd_do_sta_disconnect(int argc, char **argv)
{
    esp_err_t err = wifi_cmd_sta_disconnect();
    LOG_WIFI_CMD_DONE(err, "WIFI_DISCONNECT");
    return 0;
}

#if CONFIG_WIFI_CMD_ENABLE_DEPRECATED
static int cmd_do_sta_deprecated(int argc, char **argv)
{
    ESP_LOGW(APP_TAG, "'sta' is deprecated, please use 'sta_connect'.");
    return cmd_do_sta_connect(argc, argv);
}
static int cmd_do_disconnect_deprecated(int argc, char **argv)
{
    ESP_LOGW(APP_TAG, "'disconnect' is deprecated, please use 'sta_disconnect'.");
    return cmd_do_sta_disconnect(argc, argv);
}
#endif

static void wifi_cmd_register_sta_connect(void)
{
    if (!sta_connect_args.end) {
        sta_connect_args.ssid = arg_str0(NULL, NULL, "<ssid>", "SSID of AP");
        sta_connect_args.password = arg_str0(NULL, NULL, "<pass>", "password of AP");
        sta_connect_args.bssid = arg_str0("b", "bssid", "<bssid>", "bssid of AP");
        sta_connect_args.channel = arg_int0("n", "channel", "<channel>", "channel of AP");
        sta_connect_args.transition_disable = arg_lit0(NULL, "transition_disable", "enable transition disable");
        sta_connect_args.no_disconnect = arg_lit0(NULL, "no-disconnect", "For test: do not run esp_wifi_disconnect before connect.");
        sta_connect_args.no_reconnect = arg_lit0(NULL, "no-reconnect", "Disable auto-reconnect in wifi disconnect handler.");
        sta_connect_args.full_scan = arg_lit0(NULL, "full-scan", "do full channel scan during sta connect.");
        sta_connect_args.threshold_rssi = arg_int0(NULL, "rssi", "<rssi>", "rssi threshold");
        sta_connect_args.listen_interval = arg_int0(NULL, "listen_interval", "<listen_interval>", "listen interval");
        sta_connect_args.sort_method = arg_int0(NULL, "sort_method", "<sort_method>", "sort method");
        sta_connect_args.threshold_auth = arg_str0(NULL, "auth", "<auth>", "auth threshold");
        sta_connect_args.no_reconfig = arg_lit0(NULL, "no-reconfig", "sta connect with nvs config, ignore all other parameters");
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0) && !CONFIG_WIFI_CMD_BASIC_ONLY
        sta_connect_args.rssi_5g_offset = arg_int0(NULL, "5g-offset", "<rssi_5g_offset>", "offset value for 5g ssid when do full scan connect");
#endif
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 1) /* IDF commit: 52b24918f01a2e90f395f4056050511516aa0d6e */
        sta_connect_args.failure_retry = arg_int0(NULL, "failure_retry", "<int>", "connect sta config: failure_retry_cnt");
#endif
#if WIFI_CMD_STA_ROAM_SUPPORTED
        sta_connect_args.rm_enabled = arg_lit0(NULL, "rm", "rrm enabled");
        sta_connect_args.btm_enabled = arg_lit0(NULL, "btm", "btm enabled");
        sta_connect_args.mbo_enabled = arg_lit0(NULL, "mbo", "mbo enabled");
        sta_connect_args.ft_enabled = arg_lit0(NULL, "ft", "ft enabled");
        sta_connect_args.roam_enabled = arg_lit0(NULL, "roam", "enable all roaming related options: rm,btm,mbo,ft");
#endif /* WIFI_CMD_STA_ROAM_SUPPORTED */
#if WIFI_CMD_STA_OWE_SUPPORTED
        sta_connect_args.owe_enabled = arg_lit0(NULL, "owe", "owe enabled");
#endif
        sta_connect_args.sae_pwe = arg_int0(NULL, "sae_pwe", "<sae pwe method>", "sae pwe method");
        sta_connect_args.disable_pmf_capable = arg_lit0(NULL, "disable_pmf", "disable pmf capable");
        sta_connect_args.pmf_required = arg_lit0(NULL, "pmf_required", "pmf required");
#if WIFI_CMD_STA_SAE_PASSWORD_SUPPORTED
        sta_connect_args.sae_h2e_identifire = arg_str0(NULL, "h2e_identifier", "<str>", "h2e identifier password");
#endif
#if WIFI_CMD_STA_SAE_PK_SUPPORTED
        sta_connect_args.sae_pk_mode = arg_int0(NULL, "sae_pk_mode", "<sae pk mode>", "sae pk mode");
#endif
#if WIFI_CMD_HE_SUPPORTED
        sta_connect_args.he_mcs9 = arg_lit0(NULL, "enable_he_mcs9", "enable HE MCS8-9");
        sta_connect_args.he_dcm_set = arg_lit0(NULL, "he_dcm", "enable HE DCM");
        sta_connect_args.he_dcm_max_constellation_tx = arg_int0(NULL, "dcm_tx", "<int>", "he dcm max constellation tx");
        sta_connect_args.he_dcm_max_constellation_rx = arg_int0(NULL, "dcm_rx", "<int>", "he dcm max constellation rx");
        sta_connect_args.he_su_beamformee_disabled = arg_lit0(NULL, "su_bf_dis", "he su bmforming disabled");
        sta_connect_args.he_trig_su_bmforming_feedback_disabled = arg_lit0(NULL, "trig_su_bf_fb_dis", "he trig su bmforming feedback disabled");
        sta_connect_args.he_trig_mu_bmforming_partial_feedback_disabled = arg_lit0(NULL, "trig_mu_bf_part_fb_dis", "he trig mu bmforming partical feedback disabled");
        sta_connect_args.he_trig_cqi_feedback_disabled = arg_lit0(NULL, "trig_cqi_fb_dis", "he trig cqi feedback disabled");
#endif
#if WIFI_CMD_5G_SUPPORTED
        sta_connect_args.vht_mcs8 = arg_lit0(NULL, "enable_vht_mcs8", "enable VHT MCS8");
        sta_connect_args.vht_su_beamformee_disabled = arg_lit0(NULL, "vht_su_bf_dis", "vht su beamformee disabled");
        sta_connect_args.vht_mu_beamformee_disabled = arg_lit0(NULL, "vht_mu_bf_dis", "vht mu beamformee disabled");
#endif
#if WIFI_CMD_WPA3_COMPATIBLE_SUPPORTED
        sta_connect_args.disable_wpa3_compatible = arg_lit0(NULL, "disable_wpa3_compatible", "disable wpa3 compatible");
#endif
        sta_connect_args.end = arg_end(2);
    }
    const esp_console_cmd_t sta_connect_cmd = {
        .command = "sta_connect",
        .help = "WiFi is station mode, connect specified soft-AP",
        .hint = NULL,
        .func = &cmd_do_sta_connect,
        .argtable = &sta_connect_args
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sta_connect_cmd));

#if CONFIG_WIFI_CMD_ENABLE_DEPRECATED
    esp_console_cmd_t sta_deprecated = sta_connect_cmd;
    sta_deprecated.command = "sta";
    sta_deprecated.help = "Station mode, connect to specific AP. Deprecated, please use 'sta_connect'";
    sta_deprecated.func = &cmd_do_sta_deprecated;
    ESP_ERROR_CHECK(esp_console_cmd_register(&sta_deprecated));
#endif
}

static void wifi_cmd_register_sta_disconnect(void)
{
    const esp_console_cmd_t sta_disconnect_cmd = {
        .command = "sta_disconnect",
        .help = "WiFi is station mode, disconnect from current AP or stop reconnect.",
        .hint = NULL,
        .func = &cmd_do_sta_disconnect,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sta_disconnect_cmd));

#if CONFIG_WIFI_CMD_ENABLE_DEPRECATED
    esp_console_cmd_t disconnect_deprecated = sta_disconnect_cmd;
    disconnect_deprecated.command = "disconnect";
    disconnect_deprecated.help = "stop wifi connect. Deprecated, please use 'sta_disconnect'";
    disconnect_deprecated.func = &cmd_do_disconnect_deprecated;
    ESP_ERROR_CHECK(esp_console_cmd_register(&disconnect_deprecated));
#endif
}

#if WIFI_CMD_SCAN_PARAMETERS_SUPPORTED
typedef struct {
    struct arg_str *action;       /* set | reset | get */
    struct arg_int *max;          /* active scan time max (ms) */
    struct arg_int *min;          /* active scan time min (ms) */
    struct arg_int *passive_time; /* passive scan time (ms) */
    struct arg_int *dwell;        /* home channel dwell time (ms, uint8_t) */
    struct arg_end *end;
} sta_scan_parameters_args_t;
static sta_scan_parameters_args_t scan_parameters_args;

static void wifi_cmd_print_scan_parameters(const wifi_scan_default_params_t *p)
{
    ESP_LOGI(APP_TAG, "scan parameters: active.min=%" PRIu32 " active.max=%" PRIu32
             " passive=%" PRIu32 " dwell=%u",
             p->scan_time.active.min, p->scan_time.active.max,
             p->scan_time.passive, p->home_chan_dwell_time);
}

static int do_scan_parameters_get(void)
{
    wifi_scan_default_params_t params = {0};
    esp_err_t err = esp_wifi_get_scan_parameters(&params);
    if (err == ESP_OK) {
        wifi_cmd_print_scan_parameters(&params);
    }
    LOG_WIFI_CMD_DONE(err, "GET_SCAN_PARAMETERS");
    return 0;
}

static int do_scan_parameters_reset(void)
{
    esp_err_t err = esp_wifi_set_scan_parameters(NULL);
    LOG_WIFI_CMD_DONE(err, "RESET_SCAN_PARAMETERS");
    return 0;
}

static int do_scan_parameters_set(void)
{
    wifi_scan_default_params_t params = {0};
    esp_err_t err = 0;

    if (scan_parameters_args.max->count > 0) {
        params.scan_time.active.max = (uint32_t)scan_parameters_args.max->ival[0];
    }
    if (scan_parameters_args.min->count > 0) {
        params.scan_time.active.min = (uint32_t)scan_parameters_args.min->ival[0];
    }
    if (scan_parameters_args.passive_time->count > 0) {
        params.scan_time.passive = (uint32_t)scan_parameters_args.passive_time->ival[0];
    }
    if (scan_parameters_args.dwell->count > 0) {
        params.home_chan_dwell_time = (uint8_t)scan_parameters_args.dwell->ival[0];
    }

    err = esp_wifi_set_scan_parameters(&params);
    LOG_WIFI_CMD_DONE(err, "SET_SCAN_PARAMETERS");
    if (err == ESP_OK) {
        wifi_cmd_print_scan_parameters(&params);
    }
    return 0;
}

static int cmd_do_scan_parameters(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &scan_parameters_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, scan_parameters_args.end, argv[0]);
        return 1;
    }

