Abdussalammahmood/esp32-wifi-hw-test/firmware/iperf-esp32s3/managed_components/esp-qa__wifi-cmd/src/sta_cmd.c
    const char *action = scan_parameters_args.action->sval[0];
    if (strcmp(action, "get") == 0) {
        return do_scan_parameters_get();
    } else if (strcmp(action, "reset") == 0) {
        return do_scan_parameters_reset();
    } else if (strcmp(action, "set") == 0) {
        return do_scan_parameters_set();
    }

    ESP_LOGE(APP_TAG, "unknown action '%s', expect: set | get | reset", action);
    return 1;
}

void wifi_cmd_register_sta_scan_parameters(void)
{
    if (!scan_parameters_args.end) {
        scan_parameters_args.action       = arg_str1(NULL, NULL, "<set|get|reset>", "action to perform");
        scan_parameters_args.max          = arg_int0(NULL, "max", "<int>", "active scan time max (ms), used by 'set'");
        scan_parameters_args.min          = arg_int0(NULL, "min", "<int>", "active scan time min (ms), used by 'set'");
        scan_parameters_args.passive_time = arg_int0(NULL, "passive-time", "<int>", "passive scan time (ms), used by 'set'");
        scan_parameters_args.dwell        = arg_int0(NULL, "dwell", "<30-150>", "home channel dwell time (ms), used by 'set'");
        scan_parameters_args.end          = arg_end(2);
    }
    const esp_console_cmd_t scan_parameters_cmd = {
        .command  = "scan_parameters",
        .help     = "WiFi scan parameters: 'set' (with --max/--min/--passive-time/--dwell), "
        "'reset' to IDF defaults (passes NULL to esp_wifi_set_scan_parameters), "
        "'get' to print current values",
        .hint     = NULL,
        .func     = &cmd_do_scan_parameters,
        .argtable = &scan_parameters_args,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&scan_parameters_cmd));
}
#endif /* WIFI_CMD_SCAN_PARAMETERS_SUPPORTED */

static int cmd_do_sta_scan(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &scan_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, scan_args.end, argv[0]);
        return 1;
    }

    uint8_t ssid[33] = {0};
    uint8_t bssid[6] = {0};
    bool block_scan = false;

    wifi_scan_config_t scan_config = {0};
    if (scan_args.ssid->count > 0) {
        strlcpy((char *)ssid, scan_args.ssid->sval[0], 33);
        scan_config.ssid = ssid;
    }
    if (scan_args.bssid->count > 0) {
        if (wifi_cmd_str2mac(scan_args.bssid->sval[0], bssid) != ESP_OK) {
            ESP_LOGE(APP_TAG, "Can not parse bssid: %s", scan_args.bssid->sval[0]);
            return 1;
        }
        scan_config.bssid = bssid;
    }
    if (scan_args.channel->count > 0) {
        scan_config.channel = (uint8_t)(scan_args.channel->ival[0]);
    }
    if (scan_args.show_hidden->count > 0) {
        scan_config.show_hidden = true;
    }
    /* passive scan */
    if (scan_args.passive->count > 0) {
        scan_config.scan_type = WIFI_SCAN_TYPE_PASSIVE;
    }
    if (scan_args.passive_time->count > 0) {
        scan_config.scan_time.passive = scan_args.passive_time->ival[0];
        scan_config.scan_type = WIFI_SCAN_TYPE_PASSIVE;
    }

    if (scan_config.scan_type == WIFI_SCAN_TYPE_PASSIVE && scan_args.max->count + scan_args.min->count) {
        ESP_LOGE(APP_TAG, "Can not set active scan and passive scan at the same time");
        return 1;
    }
    /* active scan time */
    if (scan_args.min->count > 0) {
        scan_config.scan_time.active.min = scan_args.min->ival[0];
    }
    if (scan_args.max->count > 0) {
        scan_config.scan_time.active.max = scan_args.max->ival[0];
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
    if (scan_args.home_chan_dwell_time->count > 0) {
        scan_config.home_chan_dwell_time = scan_args.home_chan_dwell_time->ival[0];
    }
    /* bitmap */
    if (scan_args.bitmap_2g->count > 0) {
        scan_config.channel_bitmap.ghz_2_channels = (uint16_t)scan_args.bitmap_2g->ival[0];
    }
    if (scan_args.bitmap_5g->count > 0) {
        scan_config.channel_bitmap.ghz_5_channels = (uint32_t)scan_args.bitmap_5g->ival[0];
    }
#endif

    /* block scan */
    if (scan_args.block->count > 0) {
        block_scan = true;
    }

    g_wifi_cmd_scan_info_level = SCAN_INFO_LEVEL_1;
    if (scan_args.count_only->count > 0) {
        g_wifi_cmd_scan_info_level = SCAN_INFO_LEVEL_0;
    } else {
        if (scan_args.verbose->count == 1) {
            g_wifi_cmd_scan_info_level = SCAN_INFO_LEVEL_2;
        } else if (scan_args.verbose->count == 2) {
            g_wifi_cmd_scan_info_level = SCAN_INFO_LEVEL_3;
        }
        if (scan_args.ax_info->count > 0) {
            g_wifi_cmd_scan_info_level |= SCAN_SHOW_AX_INFO;
        }
    }
    esp_err_t err = scan_args.null->count > 0 ?
                    esp_wifi_scan_start(NULL, block_scan) :
                    esp_wifi_scan_start(&scan_config, block_scan);
    LOG_WIFI_CMD_DONE(err, "STA_SCAN_START");
    return 0;
}

#if CONFIG_WIFI_CMD_ENABLE_DEPRECATED
static int cmd_do_wifi_scan_deprecated(int argc, char **argv)
{
    ESP_LOGW(APP_TAG, "'wifi_scan' is deprecated, please use 'sta_scan'.");
    return cmd_do_sta_scan(argc, argv);
}
static int cmd_do_scan_deprecated(int argc, char **argv)
{
    ESP_LOGW(APP_TAG, "'scan' is deprecated, please use 'sta_scan'.");
    return cmd_do_sta_scan(argc, argv);
}
#endif

static void wifi_cmd_register_sta_scan(void)
{
    if (!scan_args.end) {
        scan_args.ssid = arg_str0(NULL, NULL, "<ssid>", "SSID of AP");
        scan_args.bssid = arg_str0("b", "bssid", "<bssid>", "bssid of AP");
        scan_args.channel = arg_int0("n", "channel", "<int>", "channel of AP");
        scan_args.show_hidden = arg_lit0("h", "show-hidden", "Show hidden APs");
        scan_args.null = arg_lit0(NULL, "null", "Call esp_wifi_scan_start(NULL, false)");
        scan_args.max = arg_int0(NULL, "max", "<int>", "max active scan time");
        scan_args.min = arg_int0(NULL, "min", "<int>", "min active scan time");
        scan_args.passive = arg_lit0(NULL, "passive", "Set scan type to passive");
        scan_args.passive_time = arg_int0(NULL, "passive-time", "<int>", "Set passive scan time, also set scan type to passive");
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
        scan_args.home_chan_dwell_time = arg_int0(NULL, "dwell", "<int>", "home channel dwell time (ms)");
        scan_args.bitmap_2g = arg_int0("2", "bitmap-2g", "<int/hex>", "scan bitmap 2ghz, eg: '-2 0x842'(channel:1/6/11)");
        scan_args.bitmap_5g = arg_int0("5", "bitmap-5g", "<int/hex>", "scan bitmap 5ghz, eg: '-5 0x6'(channel:36/40)");
#endif
        scan_args.count_only = arg_lit0(NULL, "count-only", "For test: do scan ap count only.");
        scan_args.ax_info = arg_lit0(NULL, "ax", "Show ax info or not.");
        scan_args.verbose = arg_litn("v", NULL, 0, 2, "Scan result info level.");
        scan_args.block = arg_lit0(NULL, "block", "Block scan");
        scan_args.end = arg_end(2);
    }
    const esp_console_cmd_t sta_scan_cmd = {
        .command = "sta_scan",
        .help = "WiFi is station mode, scan APs",
        .hint = NULL,
        .func = &cmd_do_sta_scan,
        .argtable = &scan_args
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sta_scan_cmd));

#if CONFIG_WIFI_CMD_ENABLE_DEPRECATED
    esp_console_cmd_t scan_deprecated = sta_scan_cmd;
    scan_deprecated.command = "wifi_scan";
    scan_deprecated.help = "Scan APs. Deprecated, please use 'sta_scan'";
    scan_deprecated.func = &cmd_do_wifi_scan_deprecated;
    ESP_ERROR_CHECK(esp_console_cmd_register(&scan_deprecated));
    scan_deprecated.command = "scan";
    scan_deprecated.func = &cmd_do_scan_deprecated;
    ESP_ERROR_CHECK(esp_console_cmd_register(&scan_deprecated));
#endif
}

#if WIFI_CMD_STA_WAKE_TIME_SUPPORTED
typedef struct {
    struct arg_int *unicast_wake_time;
    struct arg_int *broadcast_wake_time;
    struct arg_int *keep_alive_time;
    struct arg_end *end;
} sta_wake_time_args_t;
static sta_wake_time_args_t sta_wake_time_args;

static int cmd_do_sta_wake_time(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &sta_wake_time_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, sta_wake_time_args.end, argv[0]);
        return 1;
    }
    if (sta_wake_time_args.unicast_wake_time->count > 0) {
        esp_wifi_set_sleep_min_active_time(sta_wake_time_args.unicast_wake_time->ival[0]);
    }
    if (sta_wake_time_args.broadcast_wake_time->count > 0) {
        esp_wifi_set_sleep_wait_broadcast_data_time(sta_wake_time_args.broadcast_wake_time->ival[0]);
    }
    if (sta_wake_time_args.keep_alive_time->count > 0) {
        esp_wifi_set_keep_alive_time(sta_wake_time_args.keep_alive_time->ival[0]);
    }
    ESP_LOGI(APP_TAG, "WAKE_TIME: OK");
    return 0;
}

void wifi_cmd_register_sta_wake_time(void)
{
    if (!sta_wake_time_args.end) {
        sta_wake_time_args.unicast_wake_time = arg_int0("u", "unicast_wake_time", "<int>", "unicast wake time (ms)");
        sta_wake_time_args.broadcast_wake_time = arg_int0("b", "broadcast_wake_time", "<int>", "broadcast wake time (ms)");
        sta_wake_time_args.keep_alive_time = arg_int0("k", "keep_alive_time", "<int>", "keep alive time (ms)");
        sta_wake_time_args.end = arg_end(2);
    }
    const esp_console_cmd_t sta_wake_time_cmd = {
        .command = "sta_wake_time",
        .help = "WiFi is station mode, set wake time (unicast/broadcast/keep_alive)",
        .hint = NULL,
        .func = &cmd_do_sta_wake_time,
        .argtable = &sta_wake_time_args
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sta_wake_time_cmd));
}
#endif

void wifi_cmd_register_sta_basic(void)
{
    wifi_cmd_register_sta_connect();
    wifi_cmd_register_sta_disconnect();
    wifi_cmd_register_sta_scan();
}
